In [1]:
import pandas as pd

In [2]:
data = {'apple':[1,2,0,5],'orange':[2,3,5,4],'banana':[0,4,7,12]}
data

{'apple': [1, 2, 0, 5], 'orange': [2, 3, 5, 4], 'banana': [0, 4, 7, 12]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   apple  orange  banana
0      1       2       0
1      2       3       4
2      0       5       7
3      5       4      12

In [8]:
df = pd.DataFrame(data, index = ['A','B','C','D'])

In [9]:
df

   apple  orange  banana
A      1       2       0
B      2       3       4
C      0       5       7
D      5       4      12

In [10]:
df.head(2)

   apple  orange  banana
A      1       2       0
B      2       3       4

In [11]:
df.tail(2)

   apple  orange  banana
C      0       5       7
D      5       4      12

In [12]:
s = pd.Series(data)
s

apple      [1, 2, 0, 5]
orange     [2, 3, 5, 4]
banana    [0, 4, 7, 12]
dtype: object

In [13]:
type(df)

pandas.core.frame.DataFrame

In [15]:
type(s)

pandas.core.series.Series

In [16]:
df = pd.read_csv(r'C:\Users\HP\Desktop\Data-LB\New folder\MER_T07_02A-2020-02-03.csv')

In [17]:
df

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,CLETPUS,194913,135451.32,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
1,CLETPUS,195013,154519.994,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
2,CLETPUS,195113,185203.657,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
3,CLETPUS,195213,195436.666,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
4,CLETPUS,195313,218846.325,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
...,...,...,...,...,...,...
8211,ELETPUS,201906,351342.905,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8212,ELETPUS,201907,411583.828,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8213,ELETPUS,201908,401363.186,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8214,ELETPUS,201909,359300.603,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8215,ELETPUS,201910,321921.812,13,Electricity Net Generation Total (including fr...,Million Kilowatthours

In [18]:
df.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,CLETPUS,194913,135451.32,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
1,CLETPUS,195013,154519.994,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
2,CLETPUS,195113,185203.657,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
3,CLETPUS,195213,195436.666,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
4,CLETPUS,195313,218846.325,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours

In [19]:
df.tail()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
8211,ELETPUS,201906,351342.905,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8212,ELETPUS,201907,411583.828,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8213,ELETPUS,201908,401363.186,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8214,ELETPUS,201909,359300.603,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8215,ELETPUS,201910,321921.812,13,Electricity Net Generation Total (including fr...,Million Kilowatthours

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8216 entries, 0 to 8215
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   MSN           8216 non-null   object
 1   YYYYMM        8216 non-null   int64
 2   Value         8216 non-null   object
 3   Column_Order  8216 non-null   int64
 4   Description   8216 non-null   object
 5   Unit          8216 non-null   object
dtypes: int64(2), object(4)
memory usage: 385.2+ KB

In [21]:
df.shape

(8216, 6)

In [24]:
df.drop_duplicates(inplace = True)

In [25]:
df.shape

(8216, 6)

In [31]:
df.drop_duplicates(subset ='Value' )

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,CLETPUS,194913,135451.32,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
1,CLETPUS,195013,154519.994,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
2,CLETPUS,195113,185203.657,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
3,CLETPUS,195213,195436.666,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
4,CLETPUS,195313,218846.325,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
...,...,...,...,...,...,...
8211,ELETPUS,201906,351342.905,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8212,ELETPUS,201907,411583.828,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8213,ELETPUS,201908,401363.186,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8214,ELETPUS,201909,359300.603,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8215,ELETPUS,201910,321921.812,13,Electricity Net Generation Total (including fr...,Million Kilowatthours

In [30]:
df[df.duplicated()]['Value']

Series([], Name: Value, dtype: object)